# 🔄 Terraform Plan Results

**PR:** #1
**Commit:** 3175343e71219a6f42fd78f9e51ceb4327d89502
**Author:** @huangyingting

## 🏗️ Terraform Plan: staging

**Status:** 🟡 Changes detected
**Exit Code:** 2
**Summary:** Plan: 12 to add, 0 to change, 0 to destroy.

<details>
<summary>📋 Show Plan Details</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.app will be created
  + resource "azurerm_linux_virtual_machine" "app" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "southeastasia"
      + max_bid_price                                          = -1
      + name                                                   = "lab4-staging-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "lab4-staging-rg"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "application-server"
          + "Tier"        = "web"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.vm will be created
  + resource "azurerm_network_interface" "vm" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "southeastasia"
      + mac_address                    = (known after apply)
      + name                           = "lab4-staging-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "lab4-staging-rg"
      + tags                           = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-network-interface"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.app will be created
  + resource "azurerm_network_security_group" "app" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-staging-nsg"
      + resource_group_name = "lab4-staging-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 1003
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "network-security"
        }
    }

  # azurerm_network_security_rule.ssh_wildcard will be created
  + resource "azurerm_network_security_rule" "ssh_wildcard" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SSH"
      + network_security_group_name = "lab4-staging-nsg"
      + priority                    = 1001
      + protocol                    = "Tcp"
      + resource_group_name         = "lab4-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.vm will be created
  + resource "azurerm_public_ip" "vm" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southeastasia"
      + name                    = "lab4-staging-vm-pip"
      + resource_group_name     = "lab4-staging-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-public-access"
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = "lab4-staging-rg"
      + tags     = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
        }
    }

  # azurerm_ssh_public_key.vm will be created
  + resource "azurerm_ssh_public_key" "vm" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-staging-vm-ssh-key"
      + public_key          = (known after apply)
      + resource_group_name = "lab4-staging-rg"
      + tags                = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-ssh-access"
        }
    }

  # azurerm_subnet.app will be created
  + resource "azurerm_subnet" "app" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-app"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "lab4-staging-rg"
      + virtual_network_name                           = "lab4-staging-vnet"
    }

  # azurerm_subnet_network_security_group_association.app will be created
  + resource "azurerm_subnet_network_security_group_association" "app" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-staging-vnet"
      + resource_group_name = "lab4-staging-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "development"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "main-network"
        }
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # tls_private_key.vm[0] will be created
  + resource "tls_private_key" "vm" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_timestamp         = (known after apply)
  + environment                  = "staging"
  + network_security_group_id    = (known after apply)
  + resource_group_location      = "southeastasia"
  + resource_group_name          = "lab4-staging-rg"
  + resource_summary             = {
      + log_analytics_workspaces = 0
      + network_interfaces       = 1
      + network_security_groups  = 1
      + public_ips               = 1
      + resource_groups          = 1
      + subnets                  = 1
      + virtual_machines         = 1
      + virtual_networks         = 1
    }
  + ssh_connection_command       = (known after apply)
  + subnet_id                    = (known after apply)
  + virtual_network_id           = (known after apply)
  + virtual_network_name         = "lab4-staging-vnet"
  + vm_name                      = "lab4-staging-vm"
  + vm_private_ip                = (known after apply)
  + vm_public_ip                 = (known after apply)
```
</details>

---

## 🏗️ Terraform Plan: production

**Status:** 🟡 Changes detected
**Exit Code:** 2
**Summary:** Plan: 13 to add, 0 to change, 0 to destroy.

<details>
<summary>📋 Show Plan Details</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.app will be created
  + resource "azurerm_linux_virtual_machine" "app" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "southeastasia"
      + max_bid_price                                          = -1
      + name                                                   = "lab4-production-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "lab4-production-rg"
      + size                                                   = "Standard_B2s"
      + tags                                                   = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "application-server"
          + "Tier"        = "web"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }
    }

  # azurerm_log_analytics_workspace.main[0] will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "southeastasia"
      + name                            = "lab4-production-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "lab4-production-rg"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "monitoring"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_network_interface.vm will be created
  + resource "azurerm_network_interface" "vm" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "southeastasia"
      + mac_address                    = (known after apply)
      + name                           = "lab4-production-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "lab4-production-rg"
      + tags                           = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-network-interface"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.app will be created
  + resource "azurerm_network_security_group" "app" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-production-nsg"
      + resource_group_name = "lab4-production-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 1003
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 1002
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "network-security"
        }
    }

  # azurerm_network_security_rule.ssh_wildcard will be created
  + resource "azurerm_network_security_rule" "ssh_wildcard" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SSH"
      + network_security_group_name = "lab4-production-nsg"
      + priority                    = 1001
      + protocol                    = "Tcp"
      + resource_group_name         = "lab4-production-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.vm will be created
  + resource "azurerm_public_ip" "vm" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southeastasia"
      + name                    = "lab4-production-vm-pip"
      + resource_group_name     = "lab4-production-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-public-access"
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = "lab4-production-rg"
      + tags     = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
        }
    }

  # azurerm_ssh_public_key.vm will be created
  + resource "azurerm_ssh_public_key" "vm" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-production-vm-ssh-key"
      + public_key          = (known after apply)
      + resource_group_name = "lab4-production-rg"
      + tags                = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "vm-ssh-access"
        }
    }

  # azurerm_subnet.app will be created
  + resource "azurerm_subnet" "app" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-app"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "lab4-production-rg"
      + virtual_network_name                           = "lab4-production-vnet"
    }

  # azurerm_subnet_network_security_group_association.app will be created
  + resource "azurerm_subnet_network_security_group_association" "app" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "lab4-production-vnet"
      + resource_group_name = "lab4-production-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "production"
          + "CreatedBy"   = "github-actions"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "lab4"
          + "Purpose"     = "main-network"
        }
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # tls_private_key.vm[0] will be created
  + resource "tls_private_key" "vm" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_timestamp         = (known after apply)
  + environment                  = "production"
  + log_analytics_workspace_id   = (known after apply)
  + log_analytics_workspace_name = "lab4-production-law"
  + network_security_group_id    = (known after apply)
  + resource_group_location      = "southeastasia"
  + resource_group_name          = "lab4-production-rg"
  + resource_summary             = {
      + log_analytics_workspaces = 1
      + network_interfaces       = 1
      + network_security_groups  = 1
      + public_ips               = 1
      + resource_groups          = 1
      + subnets                  = 1
      + virtual_machines         = 1
      + virtual_networks         = 1
    }
  + ssh_connection_command       = (known after apply)
  + subnet_id                    = (known after apply)
  + virtual_network_id           = (known after apply)
  + virtual_network_name         = "lab4-production-vnet"
  + vm_name                      = "lab4-production-vm"
  + vm_private_ip                = (known after apply)
  + vm_public_ip                 = (known after apply)
```
</details>

---


---
**Note:** Plans are generated for both staging and production environments.
Review carefully before merging this PR.
